export const ChangePasswordConst = {

    heading: 'تغيير كلمة السر',
    oldPasswordLabel: 'كلمة السر الحالية',
    newPasswordLabel: 'كلمة السر الجديدة',
    passwordHintHeading: 'لا تنسى تنتبه للشروط اللي تحت',
    confirmPasswordLabel: 'تأكيد كلمة السر الجديدة',
    hint1: '8 خانات كحد أقصى (حروف أو ارقام)',
    hint2: 'من بينها حرف واحد كبير على الأقل',
    hint3: 'رقم واحد على الأقل',
    hint4: 'علامة مميزة واحدة على الأقل مثلا هاشتاق #',
    saveBtn: 'تحديث وحفظ',
    noPasswordErrorMsg: 'كلمة السر لاهنت',
    passwordNotValidFormateMsg: 'اكتب كلمة السر الجديدة لاهنت، ولازم تنتبه للشروط اللي تحت',
    confirmPasswordError: 'أكد كلمة السر الجديدة لاهنت',
    passwordFormateMsg: 'لا تنسى تنتبه للشروط اللي تحت',
    passWordMatchErrorMsg: 'ما يصير تستخدم نفس كلمة السر الحالية',
    passWordNotMatchErrorMsg: 'لازم انها تتطابق  "كلمة السر الجديدة " اللي كتبتها فوق',

    UpdatedNewPassWordToastMsg: 'الآن تقدر تستخدم كلمة السر الجديدة 👍🏼'
}