export const DeleteAccoutConst = {

    nameText: 'عسى المانع خير يا',
    deleteAccountText1: 'لازم تعرف وش بيصير إذا حذفت حسابك:',
    point11: 'بعد',
    point12: 'يوم، حسابك بينحذف بشكل كامل',
    point13: 'و',
    point14: 'و حتفقد الوصول بكل الدورات والمحتوى الرقمي اللي مسجل فيه.',
    point2: 'حجزت لاخوياك قبل؟ لا تشيل هم بيقدرون يتابعون الدورة وما بيحصل شي لحسابهم.',
    point3: 'تبي تسترجع حسابك؟ أبد، ارجع ادخل بنفس حسابك و اضغط على زر “بسترجع الحساب”.',


    recoveryText11:'حسابك بينحذف بعد',
    recoveryText12:'وراح تفقد وصولك بجميع الدورات والمحتوى الرقمي اللي مسجل فيه',
    recoveryText2:'تبي تسترجع حسابك؟ أبد، اضغط على زر “بسترجع الحساب”.',

}