export const HomeConst = {

    metaDescriptionData: 'نقدم دوراتنا بالطريقة اللي تناسبك',
    courseTypeHead1: 'حضورية',
    courseTypeHead2: 'مباشرة عن بعد',
    courseTypeHead3: 'مسجلة',
    head1: 'مهمتنا في أنا أسطوري',
    pFontMedium1: 'إننا نساعدك تجيب الدرجة الي تطمح لها 🎯 في',
    animatedText1: 'القدرات',
    animatedText2: 'التحصيلي',
    animatedText3: 'الرخصة المهنية',
    pfontMedium2: 'وأنت مبسوط ومرتاح👌',
    scrolltoSection: 'تصفّح دوراتنا',
    scrollToSectionStrockBtn: 'تواصل معنا واتساب',
    p1Head2: 'وش يميزنا',
    pDescriptionText1: 'شاملين كل شيء تحتاجه من تأسيس وتجميعات، ونرد على أسئلتك، ونتابع معك أدائك، ونضمن لك الفائدة.',
    p2Head2: 'نضمن لك الفائدة',
    pDescriptionText2: 'تطمّن 🤍 إذا ما ناسبتك الدورة خلال أول يومين بنرجّع لك فلوسك كاملة.  ',
    pDescriptionText2LinkText1: 'سياسة الضمان',
    p3Head2TypeOfCourseHeader: 'نقدم دوراتنا بـ 3 طرق',
    refCourseSecHead1: 'تصفّح دوراتنا',
    studentSectionHead1: 'درجات طلابنا',
    studentSectionLink: 'تصفح باقي الدرجات',
    studentSectionParaLine1: 'نفتخر إننا ساعدنا نحقق أهداف أكثر من 30 ألف',
    studentSectionParaLine21: 'طالب وطالبة،',
    studentSectionParaLine22: ' مستعد',
    studentSectionParaLine23: ' تكون منهم؟'


}