import Link from 'next/link';
import React, { useRef } from 'react'
import styles from '../styles/Terms.module.scss'

export default function PrivacyAndPolicy() {
	const refFooter = useRef(null);
  const scrollToFootre = () => refFooter.current?.scrollIntoView({behavior: 'smooth'});

  return (
    <div className={`maxWidthDefault ${styles.pageMainWrapper}`}>
      <h1 className={`pt-8 fontBold ${styles.pageMainHeading}`}>سياسة الخصوصية</h1>
      <h1 className={`fontBold py-3 ${styles.mainPointHeading}`}>  1. من نحن؟</h1>
      <p className={styles.discriptionText}>1-1 أنا أسطوري علامة تجارية مسجلة <Link href={'https://scbs.sa/'} className='link'>لشركة سنام لخدمات الأعمال</Link>، والبريد الإلكتروني care@scbs.sa ("أنا أسطوري"،"انا اسطوري" "نحن"، "إيانا"، "لنا")؛ الذي من خلاله تُتاح منصة أنا أسطوري للمستخدمين على النحو المنصوص عليه في الشروط والأحكام الخاصة بنا. وفيما يتعلق بالمصطلحات المكتوبة بخط بارز التي لم يتم تعريفها هنا، فقد تم تعريفها في <Link href={'/terms'} className='link'>الشروط والأحكام</Link> ؛ لذا، يجب قراءة سياسة الخصوصية هذه مع تلك الشروط.</p>
      <h1 className={`fontBold pt-6 py-3 ${styles.mainPointHeading}`}>  2. محتويات هذه السياسة</h1> 
      <p className={styles.discriptionText}>2-1 تأخذ  <Link href={"/"} className='link'>منصة أنا أسطوري</Link> بياناتكم الشخصية على محمل الجد وتُعالجها وفقًا للقوانين واللوائح المعمول بها ("قانون حماية البيانات")، حيث تتصرف منصة أنا أسطوري بصفتها "المتحكم" (أي الشخص المسؤول عن تحديد كيفية معالجة بياناتكم الشخصية) بموجب قانون حماية البيانات، وقد تبنت سياسة الخصوصية هذه ("السياسة") لغرض الحفاظ على خصوصية وأمن بياناتكم الشخصية والحفاظ عليها، حيث تشمل هذه السياسة ما يلي:</p>
      <div className='pt-2 pb-3.5 pr-3'>
        <div className='flex pb-2'>
          <p>1.</p>
          <p className={`pr-2 ${styles.discriptionText}`}>تحديد أنواع البيانات الشخصية التي نجمعها عنكم.</p>
        </div>
        <div className='flex pb-2'>
          <p>2.</p>
          <p className={`pr-2 ${styles.discriptionText}`}>توضيح كيفية جمع بياناتكم الشخصية واستخدامها والسبب وراء ذلك.</p>
        </div>
        <div className='flex pb-2'>
          <p>3.</p>
          <p className={`pr-2 ${styles.discriptionText}`}>توضيح المدة التي نحتفظ خلالها ببياناتكم الشخصية.</p>
        </div>
        <div className='flex pb-2'>
          <p>4.</p>
          <p className={`pr-2 ${styles.discriptionText}`}>توضيح كيفية مشاركة بياناتكم الشخصية – ومتى نشاركها وسبب ذلك، ومع من نشاركها.</p>
        </div>
        <div className='flex pb-2'>
          <p>5.</p>
          <p className={`pr-2 ${styles.discriptionText}`}>توضيح الحقوق والخيارات المختلفة التي تمتلكونها عندما يتعلق الأمر ببياناتكم الشخصية.</p>
        </div>
        <div className='flex pb-2'>
          <p>6.</p>
          <p className={`pr-2 ${styles.discriptionText}`}>توضيح الإجراءات الأمنية التي نطبقها لحماية بياناتكم الشخصية.</p>
        </div>
        <div className='flex pb-2'>
          <p>7.</p>
          <p className={`pr-2 ${styles.discriptionText}`}>توضيح طريقة تواصلنا معكم وطريقة تواصلكم معنا.</p>
        </div>
      </div>
      <p className={styles.discriptionText}>2-2 يرجى العلم أنه بقبول هذه السياسة وتقديم أي بيانات شخصية إلينا، فإنكم توافقون على السماح لنا جمع هذه البيانات واستخدامها والإفصاح عنها والاحتفاظ بها وفقًا لسياسة الخصوصية هذه والشروط والأحكام الخاصة بنا، وبموجب ما يسمح به القانون أو يقتضيه. وفي حال عدم موافقتكم على هذه الشروط، يرجى عدم قبولها أو تقديم أي بيانات شخصية إلينا.</p>
      <h1 className={`fontBold pt-6 py-3 ${styles.mainPointHeading}`}>  3. ما هي البيانات الشخصية التي نجمعها عنك؟</h1> 
      <p className={styles.discriptionText}>3-1 نقوم بجمع المحتوى وبيانات التواصل والمعلومات الأخرى التي تقدمونها عند استخدامكم لخدماتنا، وكذلك عند التسجيل لإنشاء حساب، أو إنشاء محتوى أو مشاركته، أو لشراء محتوى أو منتج أو إرسال رسائل إلى أشخاص آخرين أو التواصل معهم. وقد تشمل هذه البيانات التي يتم جمعها اسمك وعنوان بريدك الإلكتروني وأي معلومات مرتبطة بملفك الشخصي والمعلومات المطلوبة للالتحاق بالدورات والمعلومات الدراسية، إلا أن منصة أنا أسطوري لا تقوم بتخزين معلومات الدفع أو معالجتها، وإنما يتم التعامل مع هذه المعلومات من خلال شركاؤنا في بوابة الدفع الالكتروني مع ضمان استخدام أعلى معايير الأمان والتشفير لحماية بياناتكم الشخصية.</p>
      <p className={`pt-3.5 pb-2 ${styles.discriptionText}`}>3-2 كما أننا أيضًا نقوم بجمع البيانات الشخصية التالية:</p>
      <div className='pt-2 pb-3.5 pr-3'>
        <div className='flex pb-2'>
          <p>1.</p>
          <p className={`pr-2 ${styles.discriptionText}`}> الشبكات والتواصل: نقوم بتجميع معلومات عن الأشخاص والمنشورات والدورات التي تشتركون بها أو تُفضلونها أو تنضمون إليها وطريقة تفاعلكم معها.</p>
        </div>
        <div className='flex pb-2'>
          <p>2.</p>
          <p className={`pr-2 ${styles.discriptionText}`}> الاستخدام: نقوم بجمع معلومات عن كيفية استخدامكم للخدمات المقدمة؛ مثل: نوع المحتوى الذي تفضلونه وتتفاعلون معه والوقت الذي تقومون فيه بإجراء نشاط معين ومدته وعدد مرات تكراره والأشخاص الذين تتفاعلون معهم وطريقة استخدامك لخصائص خدماتنا.</p>
        </div>
        <div className='flex pb-2'>
          <p>3.</p>
          <p className={`pr-2 ${styles.discriptionText}`}> معلومات الأجهزة: نقوم بجمع معلومات عن الأجهزة التي تستخدمونها للوصول إلى خدماتنا، مثل: نوع الجهاز والطراز (الموديل) ونظام التشغيل وإصدار الأجهزة والبرمجيات.</p>
        </div>
      </div>
      <p className={`${styles.discriptionText}`}>3-3 علاوة على ذلك، نستخدم ملفات الارتباط الكوكيز لجمع بيانات شخصية من أجهزتكم لمساعدتنا في تحسين مستوى الخدمة المقدمة وتسهيل وصولكم لخدماتنا؛ فعلى سبيل المثال، تسمح تلك الملفات (الكوكيز) بتسهيل وصولكم للخدمات على نفس الجهاز دون الحاجة إلى إعادة تسجيل الدخول أو ضبط الإعدادات في كل مرة.</p>
      <h1 className={`fontBold pt-6 py-3 ${styles.mainPointHeading}`}>4. مصادر البيانات الشخصية </h1> 
      <p className={styles.discriptionText}>نقوم بجمع بياناتكم الشخصية منكم مباشرةً، أي أن هذه هي البيانات الشخصية التي تزودوننا بها عند استخدام خدماتنا. كذلك أننا نقوم بجمع بياناتكم الشخصية أيضًا من خلال المصادر المتاحة للجمهور، بما في ذلك قنوات التواصل الاجتماعي الخاصة بكم في حالة توصيلكم لها بمنصة أنا أسطوري، كما نقوم أيضًا بجمع بياناتكم الشخصية عن طريق نشر ملفات الارتباط كما هو موضح أعلاه.</p>
      <h1 className={`fontBold pt-6 py-3 ${styles.mainPointHeading}`}>5. كيفية وسبب استخدام البيانات الشخصية</h1> 
      <p className={styles.discriptionText}>5-1 نستخدم بياناتكم الشخصية للأغراض التالية:</p>
      <div className='pt-2 pb-3.5 pr-3'>
        <div className='flex pb-2'>
          <p>1.</p>
          <p className={`pr-2 ${styles.discriptionText}`}>إرسال معلومات إليكم فيما يتعلق بالخدمات.</p>
        </div>
        <div className='flex pb-2'>
          <p>2.</p>
          <p className={`pr-2 ${styles.discriptionText}`}>الرد على اتصالاتكم وطلباتك.</p>
        </div>
        <div className='flex pb-2'>
          <p>3.</p>
          <p className={`pr-2 ${styles.discriptionText}`}>إدارة الدورات التدريبية عبر الإنترنت ومعالجتها، بما في ذلك على سبيل المثال لا الحصر تتبع الحضور ومستوى التقدم في الدورة وإتمامها.</p>
        </div>
        <div className='flex pb-2'>
          <p>4.</p>
          <p className={`pr-2 ${styles.discriptionText}`}>تقديم الخدمات إليكم، مثل: الخدمات التي تطلبونها فيما يتعلق بالدورات التدريبية عبر الإنترنت.</p>
        </div>
        <div className='flex pb-2'>
          <p>5.</p>
          <p className={`pr-2 ${styles.discriptionText}`}>التواصل معكم عن طريق البريد الإلكتروني أو البريد العادي أو الهاتف (بما في ذلك الرسائل النصية القصيرة) فيما يتعلق بالمنتجات والخدمات واستطلاعات الرأي والدراسات البحثية والعروض الترويجية والفعاليات الخاصة وغيرها من الموضوعات التي تقدمها منصة أنا أسطوري والجهات الخارجية، والتي نرى أنها محل اهتمام لكم.</p>
        </div>
        <div className='flex pb-2'>
          <p>6.</p>
          <p className={`pr-2 ${styles.discriptionText}`}>تخصيص المحتوى الذي نقدمه من خلال الخدمات.</p>
        </div>
        <div className='flex pb-2'>
          <p>7.</p>
          <p className={`pr-2 ${styles.discriptionText}`}>مساعدتنا على فهم اهتماماتكم واحتياجاتكم بشكل أفضل مع تحسين مستوى الخدمات.</p>
        </div>
        <div className='flex pb-2'>
          <p>8.</p>
          <p className={`pr-2 ${styles.discriptionText}`}>المشاركة في تحليلات وأبحاث وتقارير تتعلق باستخدام الخدمات.</p>
        </div>
        <div className='flex pb-2'>
          <p>9.</p>
          <p className={`pr-2 ${styles.discriptionText}`}>تأمين الخدمات.</p>
        </div>
        <div className='flex pb-2'>
          <p>10.</p>
          <p className={`pr-2 ${styles.discriptionText}`}>الامتثال لأي إجراءات وأنظمة ولوائح تطبق علينا حين يلزم ذلك لمصلحتنا المشروعة أو المصالح المشروعة للآخرين.</p>
        </div>
        <div className='flex pb-2'>
          <p>11.</p>
          <p className={`pr-2 ${styles.discriptionText}`}>إثبات حقوقنا القانونية أو ممارستها أو الدفاع عنها عندما يكون ذلك في مصلحتنا المشروعة أو المصالح المشروعة للآخرين.</p>
        </div>
      </div>
      <h1 className={`fontBold pt-6 py-3 ${styles.mainPointHeading}`}>6. مدة الاحتفاظ ببياناتكم الشخصية</h1> 
      <p className={styles.discriptionText}>6-1 نحتفظ ببياناتكم الشخصية لمدة لا تزيد عما يلزم للأغراض التي يتم من أجلها معالجة تلك البيانات، أو عندما تقوم بحذف حسابك (حيث يتصدر ذلك قائمة الأغراض)، فعند حذفك لحسابك أو أي منشورات أو محتويات تشاركها، لا تتمكن من الوصول إلى البيانات المحذوفة أو استعادتها. ويتحدد طول المدة الزمنية التي نحتفظ فيها بالبيانات الشخصية عادةً بالأغراض التي نجمع من أجلها تلك البيانات ونستخدمها لها، و/أو على النحو المطلوب للامتثال للقوانين المعمول بها.</p>
      <h1 className={`fontBold pt-6 py-3 ${styles.mainPointHeading}`}>7. مشاركة البيانات</h1> 
      <p className={styles.discriptionText}>يجوز لنا مشاركة بياناتكم الشخصية مع ما يلي:</p>
      <div className='pt-2 pb-3.5 pr-3'>
        <div className='flex pb-2'>
          <p>1.</p>
          <p className={`pr-2 ${styles.discriptionText}`}>الجمهور: عندما تقوم بالمشاركة والتواصل عن طريق خدماتنا، يتمكن الجميع من مشاهدة ما تقوم بنشره، حيث يتضمن ذلك اسم المستخدم الخاص بك في أنا أسطوري، والمعلومات العامة في حسابك وأي محتوى تقوم برفعه على المنصة، فضلًا عن أن الرسائل التي تقوم بإرسالها لمستخدمين آخرين يطّلع عليها المستخدم المعني فقط بالرسالة، بالإضافة إلى أن الإعجابات والتعليقات ونسبة تقدمك في الدورات وإنجازاتك أيضا تكون ظاهرة ومرئية للجميع.</p>
        </div>
        <div className='flex pb-2'>
          <p>2.</p>
          <p className={`pr-2 ${styles.discriptionText}`}>المالك الجديد: في حالة نقل ملكية خدمات وسيطرة أنا أسطوري كليًا أو جزئيًا، أو في حال وجود تغييرات بالمنصة، يجوز لنا نقل بعض معلوماتك الشخصية للمالك الجديد.</p>
        </div>
        <div className='flex pb-2'>
          <p>3.</p>
          <p className={`pr-2 ${styles.discriptionText}`}>مقدمو الخدمات الآخرين: نعمل مع شركاء آخرين لغرض تحسين خدماتنا المقدمة. ومن هذا المنطلق، قد نشارك بعض من معلوماتك الشخصية مع هؤلاء الشركاء، ومع ذلك نقوم بوضع قيود صارمة بخصوص استخدام هذه البيانات من قبل شركائنا أو الافصاح عنها.</p>
        </div>
        <div className='flex pb-2'>
          <p>4.</p>
          <p className={`pr-2 ${styles.discriptionText}`}>الجهات الحكومية: يجوز لمنصة أنا أسطوري مشاركة معلوماتكم الشخصية مع جهات حكومية مختلفة حسب الإجراءات القانونية لإثبات حقوقنا أو حماية ملكيتنا، وأيضًا للدفاع ضد الدعاوى القانونية أو بحسب ما يقتضيه القانون. كما نحتفظ بحق إثارة أي اعتراض قانوني أو حق متاح لنا أو التنازل عنه؛ وكذلك يجوز لنا مشاركة معلوماتكم الشخصية في حال تراءى لنا ضرورة ذلك لغرض إجراء تحقيقات في أنشطة غير قانونية أو أنشطة غير شرعية مشتبه بها، أو لغرض منع تلك الأنشطة أو اتخاذ إجراء بشأنها.</p>
        </div>
      </div>
      <h1 className={`fontBold pt-6 py-3 ${styles.mainPointHeading}`}>8. روابط وخصائص الأطراف الخارجية</h1> 
      <p className={styles.discriptionText}>8-1 قد تحتوي الخدمات على روابط لمواقع أطراف خارجية، مثل: مواقع التواصل الاجتماعي، كما قد تحتوي أيضًا على عمليات دمج ووظائف تابعة لأطراف خارجية. وفي حال اختياركم لاستخدام هذه المواقع أو الخصائص، يجوز لكم الإفصاح عن بياناتكم الشخصية ليس لتلك الأطراف الخارجية وحسب، وإنما لمستخدميها أيضًا وللجمهور بشكل عام اعتمادًا على كيفية عمل خدماتهم. ومن ثم، لا تتحمل منصة أنا أسطوري مسؤولية محتوى تلك المواقع أو ممارساتها أو الخدمات التي تقدمها، وتخضع عملية جمع بياناتكم الشخصية واستخدامها والإفصاح عنها لسياسات الخصوصية الخاصة بالمواقع الإلكترونية أو الخدمات التابعة لتلك الأطراف الخارجية، وليس لسياسة الخصوصية هذه. لذا، نحثكم على قراءة سياسات الخصوصية والأمان الخاصة بهذه الأطراف الخارجية.</p>
      <h1 className={`fontBold pt-6 py-3 ${styles.mainPointHeading}`}>9. خصوصية الأبناء القُصر</h1> 
      <p className={styles.discriptionText}>9-1 إن منصة أنا أسطوري مخصصة للجمهور العام وليس للقصر، أي الذين تقل أعمارهم عن ثمانية عشر (18) عامًا. وفي حال علمنا بجمعنا لبيانات شخصية عن غير عمد لقصر دون موافقة ولي الأمر أو الوصي القانوني، نتخذ خطوات قانونية لحذفها في أقرب وقت ممكن، كما أننا نلتزم أيضًا بالقيود والمتطلبات الأخرى للفئة العمرية وفقًا للقوانين المحلية المعمول بها.</p>
      <h1 className={`fontBold pt-6 py-3 ${styles.mainPointHeading}`}>10. التخزين والنقل الدولي</h1> 
      <p className={styles.discriptionText}>10-1 بقبولكم لهذه السياسة، فإنكم توافقون على تخزين معلوماتكم داخل المملكة العربية السعودية. ولكن قد تتعاقد منصة أنا أسطوري من الباطن لغرض معالجة بياناتكم أو مشاركتها مع مقدمي الخدمة الكائنين خارج المملكة العربية السعودية وفقًا للقانون المعمول به. وقد يتم تعيين هذه الأطراف الخارجية لتقديم الخدمات إليكم ومعالجة المعاملات و/أو تقديم خدمات الدعم. وبقبولكم لهذه السياسة، فإنكم توافقون على أي عملية نقل أو تخزين أو استخدام للمعلومات.</p>
      <p className={`pt-2 ${styles.discriptionText}`}>نفي دائمًا بأي متطلبات تتعلق بالنقل الدولي للبيانات الشخصية بموجب القوانين المعمول بها. ولمزيد من المعلومات حول آليات النقل هذه، يرجى التواصل معنا من خلال <span className='link' onClick={()=>scrollToFootre()}>معلومات التواصل الواردة أدناه</span>.</p>
      <h1 className={`fontBold pt-6 py-3 ${styles.mainPointHeading}`}>11. أمن البيانات الشخصية</h1> 
      <p className={styles.discriptionText}>11-1 تهتم منصة أنا أسطوري غاية الاهتمام بسرية بياناتكم الشخصية وأمنها، وتتخذ مجموعة متنوعة من التدابير الفنية والإدارية والمادية لحماية معلوماتكم من الإفصاح عنها أو الوصول إليها من قبل أطراف خارجية. ورغم ذلك، يرجى العلم بأنه لا يمكننا ضمان أمن البيانات الشخصية، حيث لا توجد وسيلة نقل أو تخزين عبر الإنترنت آمنة على نحو تام.</p>
      <h1 className={`fontBold pt-6 py-3 ${styles.mainPointHeading}`}>12. التغييرات في هذه السياسة</h1> 
      <p className={styles.discriptionText}>12-1 يرجى العلم بأننا نراجع ممارسات الخصوصية الخاصة بنا من حين لآخر. ومن ثم، فهذه الممارسات عرضة للتغيير، حيث يسري أي تغيير أو تحديث أو تعديل على هذه السياسة فور نشره على منصتنا. وفي حالة إجراء تغيير جوهري على هذه السياسة، نخطركم بذلك بما يتناسب مع المتطلبات القانونية. وعليه، يتعين عليكم قراءة هذه السياسة والموافقة عليها في كل مرة يتم تحديثها، وإلا لن يُسمح باستخدام الخدمات.</p>
      <h1 className={`fontBold pt-6 py-3 ${styles.mainPointHeading}`}>13. الحقوق الممنوحة لكم</h1> 
      <p className={styles.discriptionText}>13-1. تُمنح حقوق معينة بموجب قانون حماية البيانات، بما في ذلك تمكينكم من الوصول إلى بياناتكم الشخصية أو تحديثها ولمزيد من المعلومات حول هذه الحقوق وكيفية ممارستها، يرجى التواصل معنا عن طريق معلومات التواصل الواردة أدناه.</p>
      <h1 className={`fontBold pt-6 py-3 ${styles.mainPointHeading}`}>14. كيفية التواصل معنا</h1> 
      <p className={styles.discriptionText}>14-1 في حالة عدم رضاكم عن كيفية تعاملنا مع بياناتك الشخصية أو كانت لديكم استفسارات أخرى حول معالجة بياناتكم الشخصية، يرجى التواصل معنا من خلال: <Link href="mailto:care@scbs.sa" className='link'>care@scbs.sa</Link> </p>
      <div ref={refFooter} className='py-4'></div>
    </div>
  )
}
